In [475]:
# Dependencies
import matplotlib.pyplot as plt
import pandas as pd
#from IPython.display import display
#from pandas.tools.plotting import table

#import tabulate
#import pandas.plotting.table as table
import numpy as np
import os

In [476]:
# load CSV files 
schoolsCSV = os.path.join('raw_data', 'schools_complete.csv')

schools_pd = pd.read_csv(schoolsCSV, encoding="iso-8859-1", low_memory=False)
schools_pd.head(20)

    School ID                   name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [477]:
#Load Student CSV file 
studentsCSV = os.path.join('raw_data', 'students_complete.csv')

students_pd = pd.read_csv(studentsCSV, encoding="iso-8859-1", low_memory=False)
students_pd.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [478]:
#cleanse of any empty rows in students
students_pd.columns
students = students_pd.dropna(how="any")
students.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [479]:
#Clean up any rows with empty values in schools data
school_count = schools_pd.dropna(how="any")

school_count.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [480]:
school_count.columns
students.columns

Index(['Student ID', 'name', 'gender', 'grade', 'school', 'reading_score',
       'math_score'],
      dtype='object')

In [481]:
#Get Total Number of school 
NumberOfSchools = len(school_count)
print(NumberOfSchools)


#get Total number of students 
TotalStudents = school_count['size'].sum()
print(TotalStudents)

#Get Total Budget
TotalBudget = school_count['budget'].sum()
print(TotalBudget)

15
39170
24649428

In [482]:
#student_schoolcount = students_pd["school"].value_counts()
#student_schoolcount

#Find average math score 
average_MathScore = students["math_score"].mean()
print(average_MathScore)

#Find average reading score 
average_ReadingScore = students["reading_score"].mean()
print(average_ReadingScore)

#Lets assume a passing score is 60 and above for Math 
passed_math = students.loc[students["math_score"] >= 60]
passed_math.head()

#Find Percent of Students who had passed math
passed_math_count = passed_math["name"].count()
print(passed_math_count)

#For reading calculate the same - Lets assume a passing rate of 65 for reading
passed_reading = students.loc[students["reading_score"] >= 65]
print(passed_reading.head())

#Find Percent of Students who had passed math
passed_reading_count = passed_reading["name"].count()
print(passed_reading_count)

78.98537145774827
81.87784018381414
36211
   Student ID               name gender grade             school  \
0           0       Paul Bradley      M   9th  Huang High School
1           1       Victor Smith      M  12th  Huang High School
2           2    Kevin Rodriguez      M  12th  Huang High School
3           3  Dr. Richard Scott      M  12th  Huang High School
4           4         Bonnie Ray      F   9th  Huang High School

   reading_score  math_score
0             66          79
1             94          61
2             90          60
3             67          58
4             97          84
37681

In [483]:
# Calculate percentage of students passign math and similarly for reading . Then calculate overall percentage 
math_percent = (passed_math_count/TotalStudents) * 100
print(math_percent)
reading_percent = (passed_reading_count/TotalStudents) * 100
print(reading_percent)

overall_passing_rate = ((math_percent + reading_percent)/2) 
print( overall_passing_rate )
#print(f" % Male: {male_percent}\n % Female: {female_percent}\n % non_specifc: {non_gender_specific}")

92.4457492979
96.1986213939
94.3221853459

In [484]:
# Create a new table consolodating above calculations
district_summary = pd.DataFrame({"Total Schools": [NumberOfSchools],
                                   "Total Students": [TotalStudents],
                                   "Total Budget": [TotalBudget],
                                   "Average Math Score": [average_MathScore],
                                   "Average Reading Score": [average_ReadingScore],
                                   "% Passing Math":[math_percent],
                                   "% Passing Reading":[reading_percent],
                                   "% Overall Passing Rate": [ overall_passing_rate ]
})
district_summary  = district_summary [["Total Schools",
                                   "Total Students",
                                   "Total Budget",
                                   "Average Math Score",
                                   "Average Reading Score",
                                   "% Passing Math",
                                   "% Passing Reading",
                                   "% Overall Passing Rate"]]

district_summary  = district_summary.round(2)

#district_summary

In [485]:
# Formatting to be done to certain columns as per sample PDF shown 
district_summary["Total Students"] = district_summary["Total Students"].map("{0:,.0f}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${0:,.2f}".format)
print ("District Summary")
district_summary
#district_summary.dtypes

District Summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.99,81.88,92.45,96.2,94.32

In [486]:
#For School Summary 

# Take only columns we need from school_count
reduced_school_count = school_count.loc[:, ['name','type','size', 'budget']]
reduced_school_count.head()

                    name      type  size   budget
0      Huang High School  District  2917  1910635
1   Figueroa High School  District  2949  1884411
2    Shelton High School   Charter  1761  1056600
3  Hernandez High School  District  4635  3022020
4    Griffin High School   Charter  1468   917500

In [487]:
reduced_school_count = reduced_school_count.rename(columns={"name":"school", 
                                                            "type":"School Type", 
                                                            "size":"Total Students", 
                                                            "budget":"Total School Budget",
                                                                 })
reduced_school_count

#district_summary.keys() 
#print (district_summary.to_html())

#ax = plt.subplot(111, frame_on=True) # no visible frame
#ax.xaxis.set_visible(False)  # hide the x axis
#ax.yaxis.set_visible(False)  # hide the y axis

#show_summary = table(ax, district_summary)  # where df is your data frame
#show_summary

#plt.savefig('mytable.png')

#print tabulate(district_summary, district_summary.keys() , tablefmt='psql')

                   school School Type  Total Students  Total School Budget
0       Huang High School    District            2917              1910635
1    Figueroa High School    District            2949              1884411
2     Shelton High School     Charter            1761              1056600
3   Hernandez High School    District            4635              3022020
4     Griffin High School     Charter            1468               917500
5      Wilson High School     Charter            2283              1319574
6     Cabrera High School     Charter            1858              1081356
7      Bailey High School    District            4976              3124928
8      Holden High School     Charter             427               248087
9        Pena High School     Charter             962               585858
10     Wright High School     Charter            1800              1049400
11  Rodriguez High School    District            3999              2547363
12    Johnson High School    District            4761              3094650
13       Ford High School    District            2739              1763916
14     Thomas High School     Charter            1635              1043130

In [488]:
# Calculate percentage of eac bootcamp's students who are recommenders
reduced_school_count["Per Student Budget"] = reduced_school_count["Total School Budget"] / reduced_school_count["Total Students"]

# Format for $ values for the Budget columns
reduced_school_count["Per Student Budget"] = reduced_school_count["Per Student Budget"].map("${0:,.2f}".format)
reduced_school_count["Total School Budget"] = reduced_school_count["Total School Budget"].map("${0:,.2f}".format)

reduced_school_count.head()

,school,School Type,Total Students,Total School Budget,Per Student Budget
0,Huang High School,District,2917,"$1,910,635.00",$655.00
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00
4,Griffin High School,Charter,1468,"$917,500.00",$625.00

In [489]:
# Take only columns we need from school_count
#name	gender	grade	school	reading_score	math_score
reduced_student_columns = students.loc[:, ['school','reading_score', 'math_score']]
reduced_student_columns.head()

              school  reading_score  math_score
0  Huang High School             66          79
1  Huang High School             94          61
2  Huang High School             90          60
3  Huang High School             67          58
4  Huang High School             97          84

In [490]:
# Group By Schools and Find Average reading score
AverageMathScore_BySchool = pd.DataFrame(reduced_student_columns.groupby("school")["math_score"].mean())

AverageMathScore_BySchool.reset_index(inplace=True)
AverageMathScore_BySchool.columns=["school", "Average Math Score"]

AverageMathScore_BySchool.head()

                 school  Average Math Score
0    Bailey High School           77.048432
1   Cabrera High School           83.061895
2  Figueroa High School           76.711767
3      Ford High School           77.102592
4   Griffin High School           83.351499

In [491]:
# Create a groupby variable that groups preTestScores by regiment
#groupby_schools = students['reading_score'].groupby(students['school'])
#groupby_schools.mean()

# Group By Schools and Find Average reading score
AverageReadingScore_BySchool = pd.DataFrame(reduced_student_columns.groupby("school")["reading_score"].mean())

AverageReadingScore_BySchool.reset_index(inplace=True)
AverageReadingScore_BySchool.columns=["school", "Average Reading Score"]

AverageReadingScore_BySchool.head()

                 school  Average Reading Score
0    Bailey High School              81.033963
1   Cabrera High School              83.975780
2  Figueroa High School              81.158020
3      Ford High School              80.746258
4   Griffin High School              83.816757

In [492]:
# Merge the two created data frames on the name of tbe school
merged_scores = pd.merge(AverageMathScore_BySchool , AverageReadingScore_BySchool, on="school")
merged_scores.head()

#Students_InEachSchool = reduced_student_columns["school"].value_counts()
#Students_InEachSchool

                 school  Average Math Score  Average Reading Score
0    Bailey High School           77.048432              81.033963
1   Cabrera High School           83.061895              83.975780
2  Figueroa High School           76.711767              81.158020
3      Ford High School           77.102592              80.746258
4   Griffin High School           83.351499              83.816757

In [493]:
# The pass score for Math is always assumed to be 60 and
# the pass score for reading is always taken at 65

# Group By Schools and Find Pass Math Count 
BySchool_MathPass = reduced_student_columns[reduced_student_columns['math_score'] >= 60].groupby('school')['math_score'].count()

#Group_BySchool = reduced_student_columns.groupby(["school"])  #grouped_usa_df = usa_ufo_df.groupby(["state"])
BySchool_MathPassCount = pd.DataFrame (BySchool_MathPass)
BySchool_MathPassCount.reset_index(level = 0, inplace = True) # df.reset_index(level=0, inplace=True)
#BySchool_MathPassCount.columns = ["school", "Math Pass Count "]
BySchool_MathPassCount.head()

                 school  math_score
0    Bailey High School        4455
1   Cabrera High School        1858
2  Figueroa High School        2608
3      Ford High School        2446
4   Griffin High School        1468

In [494]:
#Now find the Reading Pass Count 
BySchool_ReadPass = reduced_student_columns[reduced_student_columns['reading_score'] >= 65].groupby('school')['reading_score'].count()

#Group_BySchool = reduced_student_columns.groupby(["school"])  
BySchool_ReadPassCount = pd.DataFrame (BySchool_ReadPass)
BySchool_ReadPassCount.reset_index(level = 0, inplace = True) # Ensure we make the index also a column 

BySchool_ReadPassCount.head()

                 school  reading_score
0    Bailey High School           4705
1   Cabrera High School           1858
2  Figueroa High School           2788
3      Ford High School           2571
4   Griffin High School           1468

In [495]:
#Merge the Pass Data Frames on the name of school
merged_PassCount = pd.merge(BySchool_MathPassCount , BySchool_ReadPassCount, on="school")
merged_PassCount.head()

                 school  math_score  reading_score
0    Bailey High School        4455           4705
1   Cabrera High School        1858           1858
2  Figueroa High School        2608           2788
3      Ford High School        2446           2571
4   Griffin High School        1468           1468

In [496]:
#Merge the Score and Pass Data Frames on the name of school
merged_Scores_PassCount = pd.merge(merged_scores , merged_PassCount, on="school")
merged_Scores_PassCount.head()

,school,Average Math Score,Average Reading Score,math_score,reading_score
0,Bailey High School,77.048432,81.033963,4455,4705
1,Cabrera High School,83.061895,83.975780,1858,1858
2,Figueroa High School,76.711767,81.158020,2608,2788
3,Ford High School,77.102592,80.746258,2446,2571
4,Griffin High School,83.351499,83.816757,1468,1468

In [497]:
merged_school_studentData = pd.merge(reduced_school_count , merged_Scores_PassCount, on="school")
merged_school_studentData.head()

,school,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,math_score,reading_score
0,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,2592,2756
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,2608,2788
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,1761,1761
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,4129,4385
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,1468,1468

In [498]:
# Calculate percentage of Math Pass Rate and add to column 
merged_school_studentData["% Passing Math"] = merged_school_studentData["math_score"] / merged_school_studentData["Total Students"] * 100

# Sort results in descending order
#merged_df = merged_df.sort_values(["% Recommend"], ascending=False).round(2)

merged_school_studentData.head()

,school,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,math_score,reading_score,% Passing Math
0,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,2592,2756,88.858416
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,2608,2788,88.436758
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,1761,1761,100.000000
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,4129,4385,89.083064
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,1468,1468,100.000000

In [499]:
# Calculate percentage of Math Pass Rate and add to column 
merged_school_studentData["% Passing Reading"] = merged_school_studentData["reading_score"] / merged_school_studentData["Total Students"] * 100

# Sort results in descending order
#merged_df = merged_df.sort_values(["% Recommend"], ascending=False).round(2)


merged_school_studentData.head()

,school,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,math_score,reading_score,% Passing Math,% Passing Reading
0,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,2592,2756,88.858416,94.480631
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,2608,2788,88.436758,94.540522
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,1761,1761,100.000000,100.000000
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,4129,4385,89.083064,94.606257
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,1468,1468,100.000000,100.000000

In [500]:
merged_school_studentData = merged_school_studentData.rename(columns={"school":""})
merged_school_studentData.head()

,,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,math_score,reading_score,% Passing Math,% Passing Reading
0,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,2592,2756,88.858416,94.480631
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,2608,2788,88.436758,94.540522
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,1761,1761,100.000000,100.000000
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,4129,4385,89.083064,94.606257
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,1468,1468,100.000000,100.000000

In [501]:
# Calculate percentage of Math Pass Rate and add to column 
merged_school_studentData["% Overall Passing Rate"] = (merged_school_studentData["% Passing Math"] + merged_school_studentData["% Passing Reading"]) / 2
#merged_school_studentData.dtypes

#merged_school_studentData["% Passing Math"] = pd.to_numeric(merged_school_studentData["% Passing Math"])
# Sort results in descending order
#merged_df = merged_df.sort_values(["% Recommend"], ascending=False).round(2)

# Format for percentages
merged_school_studentData["% Passing Reading"] = merged_school_studentData["% Passing Reading"].map("{0:,.2f}%".format)
# Format for percentages
merged_school_studentData["% Passing Math"] = merged_school_studentData["% Passing Math"].map("{0:,.2f}%".format)

merged_school_studentData["% Overall Passing Rate"] = merged_school_studentData["% Overall Passing Rate"].map("{0:,.2f}%".format)

merged_school_studentData.head()

merged_school_studentData.drop(['math_score'], axis = 1, inplace = True)
merged_school_studentData.drop(['reading_score'], axis = 1, inplace = True)

print ("School Summary")
merged_school_studentData.head()



#Drop the unneded columns and pill in only what u need for School Summary 
#final_students_data = merged_school_studentData.iloc[:,[0,1,2,3,4,5,6,9,10,11]]

#final_students_data.reset_index(level=0, inplace=True)
#final_students_data.head()

School Summary

,,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,88.86%,94.48%,91.67%
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,88.44%,94.54%,91.49%
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,100.00%,100.00%,100.00%
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,89.08%,94.61%,91.84%
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,100.00%,100.00%,100.00%